[
  {"topic": "Identifiying Basic cooking tools for a common kitchen",
    "content": [
      {"info":"Each of these sub topics have deeper information to go into. below will give you a general idea of what they are and what they are used for ",
       "ref": ""
      },
      {"info":"It is encuraged to dive deeper into each of these sub topics to learn more!",
       "ref": ""
      }

    ],
    "subtopics": [
      {"title": "Pots",
       "parts": ["In general a pot tends to be a cooking vessel with tall edges",
                 "Tends to have two handles on opposite sides of the pot.",
                 "It could be made out of various materals like from metals, clay, or stones",
                 "usually its used for cooking liquds "],
       "ref": "https://wonderopolis.org/wonder/whats-the-difference-between-pots-and-pans",
       "img": "https://www.all-clad.com/medias/?context=bWFzdGVyfGltYWdlc3w5MzI3NHxpbWFnZS9wbmd8aW1hZ2VzL2g4My9oMzgvMTI3NDkzMTQ2MjE0NzAucG5nfGY0MjMwMDg2ZmNiM2Q2MDhlYTNiOGIxZTIyYTA0YzE4ZWQxNzk5ZTUwZWVjNjAxMDJjYTk4ZDBiZGI4MWE1NmU"},
      {"title": "Pans",
       "parts": ["In general a pan tends to be a cooking vessel with relatively low flaired edges",
                 "Thends to have a single long handle with some times a small grab handle opposite of it",
                 "Tends to be made out of metal like aluminium, cast ironn, copper, stainless steel, carbon steel",
                 "used for frying,searing and browning foods "],
       "img": "http://pngimg.com/uploads/frying_pan/frying_pan_PNG8357.png",
       "ref": ""},
      {"title": "spatulas",
       "parts": ["is a broad, flat, flexible blade used to mix, spread and lift material",
                 "Come in various sizes shapes and uses",
                 "can be made from wood, metal, and plastic"],
       "img" : "https://cdn.thewirecutter.com/wp-content/uploads/2017/10/spatulas-2x1-fullres-0946-1024x512.jpg",
       "ref": ""},
      {"title": "Knives",
       "parts": ["A chef's knife a broad blade tapering upward to a point, allowing the knife to rock back and forward for fast mincing. It’s about 6 to 12 inches long. It also tends to be the most used knife in the kitchen",
                 "A Utility knife usually between 4 and 7 inches in length, the utility knife is most of the time treated as a mini chef’s knife.",
                 "A pareing knife usually comes with a thin 3 – 4 inches blade and a very pointy tip. It can be used for cutting and peeling fruits, veggies, and trimming excess fat with precision and ease.",
                 "A Santoku knife is usually shorter and thinner than a chef’s knife. Due to a flat blade, it doesn’t rock on the cutting board. It is another good all around knife",
                 "Boning knives are typically about 3 to 8 inches in length, with slightly varying widths of blades. The blades can be flexi, semi-flexi, or stiff, ",
                 "The kitchen shears is basically a pair of scissors. Except that since they’re for various uses in the kitchen, from snipping herbs, cutting veggies to sectioning chicken and even outdoor work,",
                 "Bread knives are used for cutting bread, cakes, and sometimes meat, poultry, and seafood. They are designed in a way that allows you to saw through the bread without pushing down or squishing it.",
                 "A cleaver has a thick spine and a very strong blade, which allows it to cut through bones and meat in a chopping motion.",
                 "A steak knives are small knives that are used for not only cutting meat and fish, but also cutting salads, other (mainly cooked) foods, and spreading butter."],
       "img": "https://cdn.healthykitchen101.com/uploads/2018/01/Types-of-Kitchen-Knives-350x327.jpg",
       "ref": "https://healthykitchen101.com/types-of-kitchen-knives/"},
      {"title": "Thermometers",
       "parts": [],
       "ref": ""}
      ] },
  {"topic": "Picking good tools for the job",
   "content": [
     {"info": "coming soon",
      "ref": ""}
   ],
   "subtopics": [
     ]
   },
  {"topic": "Shopping for foods and food storage storage",
   "content": [
   {"info":"This section will cover general things you should know for when buying food for such as selecting food and storing food",
    "ref": ""
   },{"info":"Considering how large of a topic selecting food can be, this module will mainly cover fresh foods and not package ready to eat foods / easy cook foods",
    "ref": ""
   }
   ],
   "subtopics": [
    {"title": "Pork ",
     "parts": ["Pork is not graded with USDA quality grades as it is generally produced from young animals that have been bred and fed to produce more uniformly tender meat.",
               "When choosing pork, look for pale pink flesh that’s firm to touch and isn’t saggy or falling apart. The meat should be evenly covered with a layer of firm, white fat. Avoid anything that looks greasy or grey as this can mean meat is past its best.",
               "For best flavor and tenderness, meat should have a small amount of marbling.",
               "Can store in the fridge set to 40 °F or below for 3 to 5 days.",
               "Can store in the freezer for 6 to 12 months"],
     "ref": "https://www.goodhousekeeping.com/uk/food/cookery-videos/a657301/how-to-choose-pork/ https://www.foodsafety.gov/keep/charts/storagetimes.html https://tinyurl.com/y7chx797"},
    {"title": "Beef ",
      "parts": ["Beef have 3 grades USDA Prime, Choice and Select. The highest grade is Prime and the lowest is Selects",
                "These grades are based on tenderness, juiciness, and flavor",
                "Can store in the fridge set to 40 °F or below for 3 to 5 days.",
                "Can store in the freezer for 6 to 12 months"],
      "ref": "https://tinyurl.com/y7chx797 https://www.foodsafety.gov/keep/charts/storagetimes.html"},
    {"title": "Poultry ",
      "parts": ["The USDA grades for poultry are A, B, and C.",
                "Grade A is the highest quality and the only grade that is likely to be seen at the retail level. This grade indicates that the poultry products are virtually free from defects such as bruises, discolorations, and feather",
                "Grades B and C poultry are usually used in further-processed products where the poultry meat is cut up, chopped, or ground. If sold at retail, they are usually not grade identified.",
                "Can store in the fridge set to 40 °F or below for 1 to 2 days",
                "Can store in the freezer for 12 months if whole 9 months if in pieces"],
      "ref": "https://tinyurl.com/y7chx797 https://www.foodsafety.gov/keep/charts/storagetimes.html"},
    {"title": "Seafood",
     "parts": ["All fresh seafood should be held as near to 32°F as possible, which is maintained by refrigeration and/or ice.",
               "When selecting any whole fish, They should have bright, clear, full eyes that are often protruding. The gills should be bright red or pink. Fresh fish should be free of loose or sloughing slime. The flesh should be firm yet elastic, springing back when pressed gently with the finger.",
               "When selecting fish fillets or steaks they should have firm, elastic flesh and a fresh-cut, moist appearance, with no browning around the edges. The flesh should be almost translucent. There should be little evidence of bruising or reddening of the flesh from retention of blood. Prepackaged steaks and fillets should contain a minimum of liquid.",
               "Shellfish may be sold live, cooked, or fresh-shucked. Live clams, oysters, or mussels should have shells that look moist and are tightly closed. If the shells gape slightly and don't close when being tapped, dont buy it. The bottom shell of an oyster should be well cupped.  meats of fresh-shucked clams, oysters, or mussels should be plump and covered with their liquor. ",
               "Live crabs and lobsters should show leg movement. Lobsters and crabs will not be very active if they have been refrigerated, but they should move at least a little bit.",
               "Raw shrimp meat should be firm and have a mild odor. The shells of most varieties are translucent with a grayish green, pinkish tan, or light pink tint. The shells should not have blackened edges or black spots – this is a sign of quality loss.",
               "Commercially frozen fish is quickly frozen at its peak freshness. so there shouldn't be much issue getting a package of this",
               "Put seafood on ice or in the refrigerator or freezer soon after buying it. If seafood will be used within 2 days after purchase, store it in a clean refrigerator at a temperature of 40°F or below."],
     "ref": "https://www.fda.gov/food/resourcesforyou/consumers/ucm077331.htm, https://www.seafoodhealthfacts.org/seafood-safety/general-information-patients-and-consumers/guide-selecting-seafood"},
    {"title": "Fruits and vegetables",
     "parts": ["Please refer to the link with SP527.pdf below for a guide on picking fuits and vegetables",
               "please refer to the link below by realsimple.com for a guide on how to store food"],
     "ref": "https://extension.tennessee.edu/publications/Documents/SP527.pdf https://www.realsimple.com/food-recipes/shopping-storing/more-shopping-storing/how-to-store-vegetables"},
    {"title": "Gains and Rice",
     "parts": ["There isn't much of a hard and fast rule when it come to buying these products",
               "There are many varities of grains and rice which have different properties"],
     "ref": ""}
   ]
  },
  {"topic": "Cooking ",
   "content": [
   {"info":"This module will focus on preparing food in a safe and proper method as oppose to techniques to prepare food for tasty consumption.",
    "ref": ""
   }
   ],
   "subtopics": [
    {"title": "Proper food prep",
     "parts": ["Handling food"],
     "ref": ""},
    {"title": "Common cooking methods",
     "parts": ["Frying","Stewing","Baking","Grilling","Steaming"],
     "ref": ""}
   ]
 },
 {"topic": "Common recipes",
  "content": [
  {"info":"",
   "ref": ""
  }
  ],
  "subtopics": [
   {"title": "Breakfasts",
    "parts": [""],
    "ref": ""},
   {"title": "Lunch",
    "parts": [],
    "ref": ""},
   {"title": "Peer-review",
    "parts": [],
    "ref": ""}
  ]
 }

]
