[
  {"topic": "Identifying what is nutrition",
    "content": [
    {"info":"Nutrition is the study of nutrients in food, how the body uses nutrients, and the relationship between diet, health, and disease.",
     "ref": ""
    },
    {"info":"A nutrient is a source of nourishment, a component of food, for instance, protein, carbohydrate, fat, vitamin, mineral, fiber, and water.",
     "ref": ""
   },{"info":"Macronutrients are nutrients we need in relatively large quantities.",
    "ref": ""
   },
   {"info":"Micronutrients are nutrients we need in relatively small quantities.",
    "ref": ""
   },
   {"info":"Macronutrients can be further split into energy macronutrients (that provide energy), and macronutrients that do not provide energy.",
    "ref": "https://www.medicalnewstoday.com/articles/160774.php"
   }
    ],
    "subtopics": [
      {"title": "Carbohydrates",
       "parts": ["Are a macronutriet",
                 "4 kcal per gram",
                 "Carbohydrate molecules include monosaccharides (glucose, fructose, galactose), disaccharides, and polysaccharides (starch)"],
       "ref": ""},
      {"title": "Fats",
       "parts": ["Are a macronutriet",
                 "Fats - 9 kcal per gram",
                 "Fats are required in the diet for health as they serve many functions, including lubricating joints, helping organs produce hormones, assisting in absorption of certain vitamins, reducing inflammation, and preserving brain health."],
       "ref": ""},
      {"title": "Proteins",
       "parts": ["Are a macronutriet",
                 "Proteins - 4 kcal per gram",
                 "Proteins are used to produce new tissues for growth and tissue repair and regulate and maintain body functions."],
       "ref": ""},
      {"title": "Vitamins",
       "parts": ["Are a micronutrients",
                 "These are organic compounds we require in tiny amounts. (An organic compound is any molecule that contains carbon.)",
                 "It is called a vitamin when our bodies cannot synthesize (produce) enough or any of it, so we need to get it from our food."],
       "ref": ""},
      {"title": "Minerals",
       "parts": ["Dietary minerals are the other chemical elements our bodies need, other than carbon, hydrogen, oxygen, and nitrogen."],
       "ref": ""}
      ] },
  {"topic": "Assessing your nutrition",
   "content": [
   {"info":"Assessing your nutrition has changed over many years. The U.S.A has had many revisions of dietary guidelines over the years as seen in the references below",
    "ref": "https://health.gov/dietaryguidelines/1980thin.pdf https://health.gov/dietaryguidelines/1985thin.pdf https://health.gov/dietaryguidelines/1990thin.pdf https://health.gov/dietaryguidelines/dga2000/document/summary/default.htm https://health.gov/dietaryguidelines/dga95/ https://health.gov/dietaryguidelines/dga2005/document/default.htm https://health.gov/dietaryguidelines/dga2010/DietaryGuidelines2010.pdf https://health.gov/dietaryguidelines/2015/guidelines/"
   },
   {"info":"With that in mind, it is encouraged to keep up to date on what is recommened for your body at least in a 5 year span of study",
    "ref": ""
   }
   ],
   "subtopics": [
    {"title": "Diet planning",
     "parts": ["A diet plan can easily be put together, in many different ways but there are a 5 things to keep in mind",
               "Follow a healthy eating pattern across the lifespan. All food and beverage choices matter.",
               "Focus on variety, nutrient density, and amount.",
               "Limit calories from added sugars and saturated fats and reduce sodium intake.",
               "Shift to healthier food and beverage choices.",
               "Support healthy eating patterns for all."],
     "ref": "https://health.gov/dietaryguidelines/2015/guidelines/chapter-1/about/"},
    {"title": "Metabolism",
     "parts": ["Metabolism is the process by which your body converts what you eat and drink into energy.",
               "Even when you're at rest, your body needs energy for all its \"hidden\" functions, such as breathing, circulating blood, adjusting hormone levels, and growing and repairing cells.",
               "Several factors determine your individual baseline metabolism, including such as your body size, your biological sex and your age",
               "Just keep in mind that, metabolism is a natural process, your body has many mechanisms that regulate it to meet your individual needs."],
     "ref": "https://www.mayoclinic.org/healthy-lifestyle/weight-loss/in-depth/metabolism/art-20046508",
     "asdf": ""},
    {"title": "Determining how much you need to consume",
     "parts": ["In order to determine what you need to consume you need to know, what your body consumes daily",
               "The first reference below, appendix-2 tells you a \"Estimated Calorie Needs per Day, by Age, Sex, and Physical Activity Level\" ",
               "The second reference below, appendix-7 teslls you \"Nutritional Goals for Age-Sex Groups Based on Dietary Reference Intakes and Dietary Guidelines Recommendations\"",
               "The third reference below, is a online calculator that you can use to determine your current total daily energy expenditure.",
               "To gain weight you need to consume more calories than your body needs. To lose weight, you need to consume less than what your body needs. Lastly if you want to stay the same, just consume roughly what you need",
               "Take the time to follow these sources to get a general idea on how much you need to consume!"],
     "ref": "https://health.gov/dietaryguidelines/2015/guidelines/appendix-2/ https://health.gov/dietaryguidelines/2015/guidelines/appendix-7/ https://tdeecalculator.net/" },
    {"title": "Reading food labels and understand what they mean",
     "parts": [],
     "ref": ""}
   ]
  },
  {"topic": "Finding reliable Nutrition information",
   "content": [
   {"info":"A nutritional assessment is used to determine the nutritional status of a person or group of people.",
    "ref": ""
   }
   ],
   "subtopics": [
    {"title": "Testimonials",
     "parts": [],
     "ref": ""},
    {"title": "Scientific method",
     "parts": [],
     "ref": ""},
    {"title": "Peer-review",
     "parts": [],
     "ref": ""}
   ]
  }

]
